main/DataProcessors/СтатистикаЧисел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>СтатистикаЧисел</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЧислаМаксимальноВыпадавшие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Число</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Частота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТиражейНазад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомбинауииПарЧисел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Число1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Число2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СколькоРазЧислоВПаре</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Число</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомбинацииДляИгры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоэффициентСуммарности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентВзаимодействия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентАктивности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентОбщий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комбинация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

main/InformationRegisters/КомбинацииЧисел_7_49.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>КомбинацииЧисел_7_49</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НомерТиража</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Число7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/InformationRegisters/ПоследнийНомерТиража_7_49.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ПоследнийНомерТиража_7_49</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТиража</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/DataProcessors/СтатистикаЧисел/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЧислоМаксмиальноВыпадавшихЧисел();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗапонитьЧастоВыпадающие(Команда)
	
	ЗаполнитьЧислоМаксмиальноВыпадавшихЧисел();
	РассчитатьОбщееЧислоТиражей();
	ПолучитьНомерПоследнегоТиража();
	РассчитатьЧастотуВыпаданияЧисел();
	РассчитатьСколькоТиражейНазадВыпадлоЧисло();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКомбинации(Команда)
	
	РассчитатьКомбинацииНаСервере();
	РассчитатьСколькоРазЧислоБылоВПаре();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКомбинации(Команда)
	
	Объект.КомбинауииПарЧисел.Очистить();
	Объект.СколькоРазЧислоВПаре.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКомбинации(Команда)
	
	МассивЧиселДляИгры = Новый Массив;
	
	Пока МассивЧиселДляИгры.Количество() < 7 Цикл
		
		КоэффициентСдвига = 0;
		
		Для каждого СтрокаТЧ Из Объект.ЧислаМаксимальноВыпадавшие Цикл
			
			Если МассивЧиселДляИгры.Количество() = 7 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаТЧ.КоличествоТиражейНазад + КоэффициентСдвига > СтрокаТЧ.Частота Тогда
				МассивЧиселДляИгры.Добавить(СтрокаТЧ.Число);	
			КонецЕсли;
			
		КонецЦикла;
		
		КоэффициентСдвига = КоэффициентСдвига + 1;
		
	КонецЦикла;
	
	СтрокаКомбинации = "";
	
	Для Сч = 1 По 7 Цикл
		ЧислоДляИгры = МассивЧиселДляИгры[Сч - 1];
		ЭтотОбъект["Число" + Сч] = ЧислоДляИгры;
		СтрокаКомбинации = СтрокаКомбинации + ?(СтрокаКомбинации = "", "", "/") + ЧислоДляИгры;
	КонецЦикла;
	
	НоваяСтрока = Объект.КомбинацииДляИгры.Добавить();
	НоваяСтрока.Комбинация = СтрокаКомбинации;
	НоваяСтрока.Комментарий = "рассчитана по частоте";
	
	ОчиститьКомбинации(Неопределено);
	РассчитатьКомбинации(Неопределено);
	
	СтруктураКоэффициентов = РассчитатьКоэффициенты(МассивЧиселДляИгры);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКоэффициентов);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоэффициентыПоСвоейКомбинации(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка", Истина);
	
	НайденныеСтроки = Объект.КомбинацииДляИгры.НайтиСтроки(ПараметрыОтбора);
	
	СтрокаКомбинации = НайденныеСтроки[0].Комбинация;
		
	МассивЧиселДляИгры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКомбинации, "/");
	
	Для Сч = 1 По 7 Цикл
		ЭтотОбъект["Число" + Сч] = МассивЧиселДляИгры[Сч - 1];
	КонецЦикла;
	
	ОчиститьКомбинации(Неопределено);
	РассчитатьКомбинации(Неопределено);
	
	СтруктураКоэффициентов = РассчитатьКоэффициенты(МассивЧиселДляИгры);
	ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтруктураКоэффициентов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьЧислоМаксмиальноВыпадавшихЧисел()
	
	Объект.ЧислаМаксимальноВыпадавшие.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ [КоличесвтоЗаписей]
	|	КомбинацииЧисел_7_49.Число1 КАК Число1,
	|	КомбинацииЧисел_7_49.Число2 КАК Число2,
	|	КомбинацииЧисел_7_49.Число3 КАК Число3,
	|	КомбинацииЧисел_7_49.Число4 КАК Число4,
	|	КомбинацииЧисел_7_49.Число5 КАК Число5,
	|	КомбинацииЧисел_7_49.Число6 КАК Число6,
	|	КомбинацииЧисел_7_49.Число7 КАК Число7,
	|	КомбинацииЧисел_7_49.НомерТиража КАК НомерТиража
	|ПОМЕСТИТЬ ВТ_ПоследниеТиражи
	|ИЗ
	|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
	|
	| [Порядок]
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число1 КАК Число,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ_ВыпадавшиеЧисла
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число2,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число3,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число4,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число5,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число6,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоследниеТиражи.Число7,
	|	1
	|ИЗ
	|	ВТ_ПоследниеТиражи КАК ВТ_ПоследниеТиражи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыпадавшиеЧисла.Число КАК Число,
	|	СУММА(ВТ_ВыпадавшиеЧисла.Количество) КАК Количество
	|ИЗ
	|	ВТ_ВыпадавшиеЧисла КАК ВТ_ВыпадавшиеЧисла
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыпадавшиеЧисла.Число
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ,
	|	Число";
	
	Если ЗначениеЗаполнено(КоличествоТиражей) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[КоличесвтоЗаписей]", "ПЕРВЫЕ " + КоличествоТиражей);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[Порядок]", "УПОРЯДОЧИТЬ ПО КомбинацииЧисел_7_49.НомерТиража УБЫВ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[КоличесвтоЗаписей]", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[Порядок]", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.ЧислаМаксимальноВыпадавшие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьКомбинацииНаСервере()
	
	//Объект.КомбинауииПарЧисел.Очистить();
	//Объект.СколькоРазЧислоВПаре.Очистить();
	
	МассивПар = Новый Массив;
	
	ТекНомер = 0;
	
	Пока ТекНомер < 7 Цикл
		
		ТекНомер = ТекНомер + 1;
		
		Если ЭтотОбъект["Число" + ТекНомер] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Сч = ТекНомер + 1 По 7 Цикл
			
			Если ЭтотОбъект["Число" + Сч] = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПары = Новый Структура;
			СтруктураПары.Вставить("Число1", ЭтотОбъект["Число" + ТекНомер]);
			СтруктураПары.Вставить("Число2", ЭтотОбъект["Число" + Сч]);
			СтруктураПары.Вставить("Количество", 0);
			
			МассивПар.Добавить(СтруктураПары);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КомбинацииЧисел_7_49.Число1 КАК Число1,
	|	КомбинацииЧисел_7_49.Число2 КАК Число2,
	|	КомбинацииЧисел_7_49.Число3 КАК Число3,
	|	КомбинацииЧисел_7_49.Число4 КАК Число4,
	|	КомбинацииЧисел_7_49.Число5 КАК Число5,
	|	КомбинацииЧисел_7_49.Число6 КАК Число6,
	|	КомбинацииЧисел_7_49.Число7 КАК Число7,
	|	КомбинацииЧисел_7_49.НомерТиража КАК НомерТиража
	|ИЗ
	|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТиража УБЫВ";
	
	Если ЗначениеЗаполнено(КоличествоТиражей) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + КоличествоТиражей);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для каждого ПараЧисел Из МассивПар Цикл
			
			КомбинацияБылаПоЧислу1 = Ложь;
			КомбинацияБылаПоЧислу2 = Ложь;
			
			Для Сч = 1 По 7 Цикл
				
				Если ПараЧисел.Число1 = ВыборкаДетальныеЗаписи["Число" + Сч] Тогда
					КомбинацияБылаПоЧислу1 = Истина;	
				КонецЕсли;
				
				Если ПараЧисел.Число2 = ВыборкаДетальныеЗаписи["Число" + Сч] Тогда
					КомбинацияБылаПоЧислу2 = Истина;	
				КонецЕсли;
				
			КонецЦикла;
			
			Если КомбинацияБылаПоЧислу1 И КомбинацияБылаПоЧислу2 Тогда
				ПараЧисел.Количество = ПараЧисел.Количество + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого ПараЧисел Из МассивПар Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Число1", ПараЧисел.Число1);
		СтруктураПоиска.Вставить("Число2", ПараЧисел.Число2);
		
		НайденныеСтроки = Объект.КомбинауииПарЧисел.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.КомбинауииПарЧисел.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараЧисел);
		Иначе
			НайденныеСтроки[0].Количество = ПараЧисел.Количество;	
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.КомбинауииПарЧисел.Сортировать("Количество УБЫВ, Число1, Число2");
	
	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьОбщееЧислоТиражей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КомбинацииЧисел_7_49.НомерТиража) КАК НомерТиража
	|ИЗ
	|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ВсегоТиражей = ВыборкаДетальныеЗаписи.НомерТиража;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНомерПоследнегоТиража()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоследнийНомерТиража_7_49.НомерТиража КАК НомерТиража
	|ИЗ
	|	РегистрСведений.ПоследнийНомерТиража_7_49 КАК ПоследнийНомерТиража_7_49";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	НомерПоследнегоТиража = ВыборкаДетальныеЗаписи.НомерТиража;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЧастотуВыпаданияЧисел()
	
	Для каждого СтрокаЧисел Из Объект.ЧислаМаксимальноВыпадавшие Цикл
		Если СтрокаЧисел.Количество <> 0 Тогда
			СтрокаЧисел.Частота = ВсегоТиражей / СтрокаЧисел.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСколькоТиражейНазадВыпадлоЧисло()
	
	Для каждого СтрокаЧисл Из Объект.ЧислаМаксимальноВыпадавшие Цикл
		         		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КомбинацииЧисел_7_49.НомерТиража КАК НомерТиража,
		|	КомбинацииЧисел_7_49.Число1 КАК Число
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число1 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число2
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число2 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число3
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число3 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число4
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число4 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число5
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число5 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число6
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число6 = &Число
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииЧисел_7_49.НомерТиража,
		|	КомбинацииЧисел_7_49.Число7
		|ИЗ
		|	РегистрСведений.КомбинацииЧисел_7_49 КАК КомбинацииЧисел_7_49
		|ГДЕ
		|	КомбинацииЧисел_7_49.Число7 = &Число
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТиража УБЫВ";
		
		Запрос.УстановитьПараметр("Число", СтрокаЧисл.Число);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СтрокаЧисл.КоличествоТиражейНазад = НомерПоследнегоТиража - ВыборкаДетальныеЗаписи.НомерТиража;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСколькоРазЧислоБылоВПаре()
	
	Для Сч = 1 По 7 Цикл
		
		ПроверяемоеЧисло = ЭтотОбъект["Число" + Сч];
		Если ПроверяемоеЧисло = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоВПарах = 0;
		
		Для каждого СтрокаТЧ Из Объект.КомбинауииПарЧисел Цикл
			
			Если ПроверяемоеЧисло = СтрокаТЧ.Число1 И СтрокаТЧ.Количество <> 0 Тогда
				КоличествоВПарах = КоличествоВПарах + 1;
			КонецЕсли;
			
			Если ПроверяемоеЧисло = СтрокаТЧ.Число2 И СтрокаТЧ.Количество <> 0 Тогда
				КоличествоВПарах = КоличествоВПарах + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока = Объект.СколькоРазЧислоВПаре.Добавить();
		НоваяСтрока.Число = ПроверяемоеЧисло;
		НоваяСтрока.Количество = КоличествоВПарах;
		
	КонецЦикла;
	
	Объект.СколькоРазЧислоВПаре.Сортировать("Количество УБЫВ");
	
КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоэффициенты(МассивЧиселДляИгры)
	
	ОбщийКоэффициентСуммарности = 0;
	ОбщийКоэффициентАктивности = 0;
	ОбщийКоэффициентВзаимодействия = 0;
	
	Для Сч = 1 По 7 Цикл
		
		КоэффициентСуммарности = РассчитатьКоэффициентСуммарности(Число(МассивЧиселДляИгры[Сч - 1]));
		ОбщийКоэффициентСуммарности = ОбщийКоэффициентСуммарности + КоэффициентСуммарности;
		
		КоэффициентАктивности = РассчитатьКоэффициентАктивности(Число(МассивЧиселДляИгры[Сч - 1]));
		ОбщийКоэффициентАктивности = ОбщийКоэффициентАктивности + КоэффициентАктивности;
		
	КонецЦикла;
			
	ОбщийКоэффициентВзаимодействия = РассчитатьКоэффициентВзаимодействия();
	
	СтруктураКоэффициентов = Новый Структура;
	СтруктураКоэффициентов.Вставить("КоэффициентСуммарности", ОбщийКоэффициентСуммарности);
	СтруктураКоэффициентов.Вставить("КоэффициентАктивности", ОбщийКоэффициентАктивности);
	СтруктураКоэффициентов.Вставить("КоэффициентВзаимодействия", ОбщийКоэффициентВзаимодействия);
	СтруктураКоэффициентов.Вставить("КоэффициентОбщий", ОбщийКоэффициентСуммарности + ОбщийКоэффициентАктивности + ОбщийКоэффициентВзаимодействия);
	
	Возврат СтруктураКоэффициентов;
	
КонецФункции

&НаКлиенте
Функция РассчитатьКоэффициентСуммарности(Число)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Число", Число);
	
	Строки = Объект.ЧислаМаксимальноВыпадавшие.НайтиСтроки(ПараметрыОтбора);
	
	Возврат Строки[0].Количество;
	
КонецФункции

&НаКлиенте
Функция РассчитатьКоэффициентАктивности(Число)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Число", Число);
	
	Строка = Объект.ЧислаМаксимальноВыпадавшие.НайтиСтроки(ПараметрыОтбора)[0];
	
	Если Строка.Частота = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Окр(Строка.КоличествоТиражейНазад / Строка.Частота, 2);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция РассчитатьКоэффициентВзаимодействия()
	
	ВсегоПар = Объект.КомбинауииПарЧисел.Количество();
	
	ВсегоВзаимодействующихПар = 0;
	Для каждого СтрокаТЧ Из Объект.КомбинауииПарЧисел Цикл
		Если СтрокаТЧ.Количество <> 0 Тогда
			ВсегоВзаимодействующихПар = ВсегоВзаимодействующихПар + 1;
		КонецЕсли;
	КонецЦикла;
	
	ВесСтрок = ВсегоВзаимодействующихПар / ВсегоПар;
	
	КоэффициентВзаимодействия = 0;
	Для каждого СтрокаТЧ Из Объект.КомбинауииПарЧисел Цикл
		КоэффициентПары = СтрокаТЧ.Количество * ВесСтрок;	
		КоэффициентВзаимодействия = КоэффициентВзаимодействия + КоэффициентПары;
	КонецЦикла;
	
	Возврат КоэффициентВзаимодействия;
	
КонецФункции

#КонецОбласти
